package pro.jiaoyi.search.util;

/*
TF-IDF（Term Frequency-Inverse Document Frequency）是一种用于信息检索与文本挖掘的常用技术。它结合了词频（Term Frequency，TF）和逆文档频率（Inverse Document Frequency，IDF）两个指标，用于评估一个词语在文档集中的重要性。

TF（词频）衡量一个词在一个文档中出现的频率，它认为一个词在文档中出现的次数越多，那么它对该文档的重要性就越高。

IDF（逆文档频率）衡量一个词的普遍重要性，它通过计算在整个文档集中包含该词的文档数量的倒数来得到。如果一个词在很多文档中都出现，那么它的IDF值就较低，认为它对区分文档的能力较弱；相反，如果一个词在少数文档中出现，那么它的IDF值就较高，认为它对区分文档的能力较强。

TF-IDF将TF和IDF结合起来，通过计算一个词的TF和IDF的乘积来衡量它在文档集中的重要性。一个词在某个文档中的TF-IDF值越高，表示它在该文档中的重要性越大，并且在其他文档中较少出现。

使用TF-IDF可以对文档集进行关键词提取、文档相似度计算、信息检索等任务，帮助识别和区分文本中重要的词语。
 */
public class TDIDF {



}
